app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')